app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "145199917.de0534b.2f8bb24083b04a76bdc4fc864973ea2f"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?)  [["name", "Rohit Lalchandani"], ["created_at", 2016-10-09 21:40:15 UTC], ["updated_at", 2016-10-09 21:40:15 UTC], ["uid", "145199917.de0534b.2f8bb24083b04a76bdc4fc864973ea2f"]]
---
  def login
    code = params[:code]
    if !code.nil?
      response = Unirest.post "https://api.instagram.com/oauth/access_token",
                              parameters: {client_id: @@client_id,
                                           client_secret: @@client_secret,
                                           grant_type: 'authorization_code',
                                           code: code,
                                           redirect_uri: @@redirect_uri
                                          }
      user = response.body["user"]
      token = response.body["access_token"]
      if User.find_by(uid: token).nil?
        User.create({ uid: token, name: user["full_name"] })

INSERT INTO "photos" ("url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "https://res.cloudinary.com/laucity/image/upload/v1476086021/ywxzlfvc7elvh7t3pdpu.jpg"], ["user_id", 1], ["created_at", 2016-10-10 07:53:41 UTC], ["updated_at", 2016-10-10 07:53:41 UTC]]
---
  def new_image

    photo = Photo.create(url: params[:url], user_id: @user.id)