app/controllers/application_controller.rb

  def new_photo
    photo = Photo.create(url: params[:url], user_id: @user.id)
---
INSERT INTO "photos" ("url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "https://res.cloudinary.com/laucity/image/upload/v1476385724/ffbuslhqkrwu5uixmela.jpg"], ["user_id", 1], ["created_at", 2016-10-13 19:08:45 UTC], ["updated_at", 2016-10-13 19:08:45 UTC]]

  def get_photos
    images = Photo.where(user_id: @user.id)
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]